Can't rotate Load because rotation axis is not perpendicular to sketch plane.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId CannotRotateLoad { get; }
  Visual Basic
Public Shared ReadOnly Property CannotRotateLoad As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ CannotRotateLoad {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures LoadFailures Class
  Autodesk.Revit.DB Namespace